
<article class="content-block section" data-dropdown="responsive" data-dropdown-title=".content-block__toggler" data-dropdown-body=".content-block__dropdown" data-disable-close>
  <div class="content-block__container">
    <h2 class="content-block__title section__title">Купить газобетонные блоки в СПб</h2>
    <div class="content-block__preview">
      <p class="content-block__preview-text">Монолит – мультиканальный и омниканальный дистрибьютор строительных и отделочных материалов на территории РФ. В нашем интернет-магазине представлено свыше 50 000 строительных материалов от более чем 150 популярных брендов из России и Европы.Более чем за 10 лет работы более 15 000 клиентов убедились в качестве сервиса и стали нашими постоянными покупателями.</p><a class="content-block__toggler" href="#"></a>
    </div>
    <div class="content-block__dropdown">
      <div class="content-block__body">
        <h3>Основные требования к современной теплоизоляции</h3>
        <p>Качественная теплоизоляция должна максимально снижать тепловую передачу, обеспечивая сохранение комфортных температурных показателей внутри помещений. В зависимости от специфики объекта утепляться могут внутренние и наружные стены, перекрытия, мансарды, пол, кровля и другие конструкционные части зданий.</p>
        <p>Несмотря на все разнообразие теплоизоляционных материалов, к ним выдвигаются стандартные требования. Они касаются таких показателей, как:</p><img src="assets/template/pictures/content/content-1.jpg" alt="content">
        <p>Несмотря на все разнообразие теплоизоляционных материалов, к ним выдвигаются стандартные требования. Они касаются таких показателей, как:</p>
        <ul>
          <li>Низкая теплопроводность;</li>
          <li>Простота монтажа;</li>
          <li>Паропроницаемость;</li>
          <li>Влагостойкость;</li>
          <li>Пожарная безопасность;</li>
          <li>Лёгкость;</li>
          <li>Безопасность для человека;</li>
          <li>Удобство транспортировки;</li>
          <li>Долговечность.</li>
        </ul>
        <blockquote>
          <p>Соотношение этих характеристик может быть разным, что в немалой степени определяет стоимость материалов для теплоизоляции.</p>
        </blockquote>
        <h3>Виды утеплителей и их применение</h3>
        <p>На современном рынке предложен широкий выбор материалов для наружного и внутреннего утепления домов. Для стен зданий со стороны улицы может использоваться:</p>
        <ul>
          <li>Низкая теплопроводность;</li>
          <li>Простота монтажа;</li>
          <li>Паропроницаемость;</li>
          <li>Влагостойкость;</li>
          <li>Пожарная безопасность;</li>
          <li>Лёгкость;</li>
          <li>Безопасность для человека;</li>
          <li>Удобство транспортировки;</li>
          <li>Долговечность.</li>
        </ul><img src="assets/template/pictures/content/content-2.jpg" alt="content">
        <p>Качественная теплоизоляция должна максимально снижать тепловую передачу, обеспечивая сохранение комфортных температурных показателей внутри помещений. В зависимости от специфики объекта утепляться могут внутренние и наружные стены, перекрытия, мансарды, пол, кровля и другие конструкционные части зданий.</p>
        <p>Несмотря на все разнообразие теплоизоляционных материалов, к ним выдвигаются стандартные требования. Они касаются таких показателей, как:</p>
      </div>
    </div>
  </div>
</article>
