<article class="content-block section" data-dropdown="responsive" data-dropdown-title=".content-block__toggler" data-dropdown-body=".content-block__dropdown" data-disable-close>
  <div class="content-block__container">
    <h2 class="content-block__title section__title">Купить газобетонные блоки в СПб</h2>
    <div class="content-block__preview">
      <p class="content-block__preview-text">Монолит – мультиканальный и омниканальный дистрибьютор строительных и отделочных материалов на территории РФ. В нашем интернет-магазине представлено свыше 50 000 строительных материалов от более чем 150 популярных брендов из России и Европы.Более чем за 10 лет работы более 15 000 клиентов убедились в качестве сервиса и стали нашими постоянными покупателями.</p><a class="content-block__toggler" href="#"></a>
    </div>
    <div class="content-block__dropdown">
      <div class="content-block__body">
        <h3>Основные требования к современному газобетону для строительства зданий</h3>
        <p>
          Качественный газобетон должен обеспечивать максимально эффективное утепление, обеспечивая сохранение комфортной температуры внутри зданий. В зависимости от специфики объекта, газобетон может применяться для утепления внутренних и наружных стен, перекрытий, мансард, пола, кровли и других конструкционных элементов.
        </p>
        <p>Основными требованиями к современному газобетону для строительства являются:</p>
        <img src="assets/template/pictures/content/content-1.jpg" alt="content">
        <ul>
          <li>
            Легкость. Газобетон имеет маленькую плотность и небольшой вес. Это позволяет значительно упростить транспортировку и монтаж.
          </li>
          <li>
            Теплоизоляция. Газобетон обладает высокой термической изоляцией, что позволяет существенно уменьшать теплопотери и снижать расходы на отопление.
          </li>
          <li>
            Экологичность. Газобетон является экологически чистым материалом, не содержит вредных веществ и не выбрасывает их в процессе эксплуатации.</li>
          <li>
            Звукоизоляция. Газобетон обладает высокими звукопоглощающими свойствами и позволяет уменьшить уровень шума внутри помещений.
          </li>
          <li>
            Прочность. Газобетон обладает высокой прочностью на сжатие и изгиб, что позволяет использовать его для строительства зданий различной высоты и назначения.
          </li>
          <li>
            Пожарная безопасность. Газобетон не горючий материал и не отдаёт горючих газов при обработке высокой температурой.
          </li>
          <li>
            Устойчивость к влаге и морозам. Газобетон устойчив к воде и влаге, а также морозам, что позволяет использовать его в любых климатических условиях.
          </li>
        </ul>
        <blockquote>
          <p>Соотношение этих показателей может варьироваться в зависимости от типа газобетона, что, в свою очередь, определяет его стоимость.</p>
        </blockquote>
        <h3>Варианты утеплителей на базе газобетона и их применение</h3>
        <p>На рынке представлен широкий выбор материалов на основе газобетона для наружного и внутреннего утепления зданий. Для утепления стен зданий с улицы часто используются:</p>
        <ul>
          <li>Полнотелый газобетон;</li>
          <li>Пустотелый газобетон;</li>
          <li>Ячеистый бетон.</li>
        </ul><img src="assets/template/pictures/content/content-2.jpg" alt="content">
        <p>Выбор материала на основе газобетона зависит от объема работ, условий строительства, климата и других факторов. В любом случае, использование газобетона позволяет создавать теплоизолированные конструкции высокого качества, обладающие прочностью и долговечностью.
        </p>
      </div>
    </div>
  </div>
</article>
