<article class="faq section section_view_bg">
  <div class="faq__container">
    <h2 class="faq__title section__title">Часто задаваемые вопросы</h2>
    <div class="faq__list">
      <div class="faq__column">
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
      </div>
      <div class="faq__column">
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
        <div class="faq-item" data-dropdown="responsive" data-disable-close>
          <div class="faq-item__top">
            <p class="faq-item__title">Есть ли возможность оплаты после получения материала?</p>
            <button class="faq-item__toggler"></button>
          </div>
          <div class="faq-item__dropdown">
            <div class="faq-item__content">
              <p class="faq-item__text">Помимо стен и кровли теплоизоляционный слой необходим также для пола. По статистике, в среднем на пол приходится около 20% всех теплопотерь. На данный показатель влияет этажность здания, характеристики фундамента, наличие подвальных помещений, материал, из которого изготовлен пол, и многие другие параметры. Иными словами, теплоизоляция пола позволяет защитить помещение от низких температур и сквозняков, которые могут не только свести на нет комфорт пребывания в нем, но и уменьшить эксплуатационный срок всего здания. В качестве теплоизоляционного материала для пола может использоваться минеральная и эко вата, пенополистирол, жидкие утеплители.</p>
            </div>
          </div>
        </div>
      </div>
    </div>
    <button class="faq__more btn btn_style_trans">Показать ещё вопросы</button>
  </div>
</article>
