{if $_modx->resource.introtext}
  <div>{$_modx->resource.introtext}</div>
{/if}
<p><a class="btn btn_style_base  btn_style_compact" data-fancybox href="#callback">Заказать замер</a></p>
<blockquote class="">Замер кровли проводится по стропильной системе. Мы создаем эскиз на каждый сегмент крыши, учитывая
  все скаты. После чего мы предоставляем полный и наглядный план Вашей кровли.</blockquote>
<h2>Какие измерения необходимы?</h2>
<ol class="spacious">
  <li>Длина ската по коньку и по карнизу, высота от низшей точки карниза до высшей точки конька. Для исключения
    возможных отклонений измеряется диагональ ската.</li>
  <li>Размеры печной трубы, расстояние от ее левого нижнего угла до левой боковой стороны и карниза ската.</li>
  <li>Длина карниза по фронтону, расстояние между карнизами.</li>
  <li>Длина карнизных свесов от стены до края карниза.</li>
  <li>Длина фронтонных свесов от стены до края фронтона.</li>
  <li>Длина примыканий кровли к стенам и элементам крыши.</li>
  <li>Высота дома от земли до высшей точки конька.</li>
  <li>Высота стены от земли до карниза.</li>
</ol>
<p>
  <img src="assets/images/content/zamer-1.png" alt="" width="400" />
</p>
<h2>Почему важен замер?</h2>
<ul>
  <li>Ремонт кровли, фасада, фундамента и т.д. не может обойтись без сметы. Для правильного комплектования вашего
    объекта необходимыми строительными материалами наш специалист должен обладать всей информацией о размерах кровли или
    фасада, особенностях их конструкции и другими важными техническими параметрами.</li>
  <li>Отлично если у вас есть готовый проект с чертежами и размерами, но за частую мы сталкиваемся с иной ситуацией!
  </li>
  <li>Самостоятельное составление эскиза подходящего для точного расчета, зачастую не под силу даже людям с техническим
    образованием. И это абсолютно нормально, так как вы не сталкиваетесь с данной задачей ежедневно. Как следствие не
    точные и не полные измерения приводят к ошибочному расчету.</li>
  <li>Итог - материала не хватает, либо остается слишком много! В первом случае приходится его довозить и тратить
    дополнительные средства на доставку, во втором ломать голову, куда деть лишнее. Нередки случаи, когда, например, при
    ремонте кровли не задумались о необходимости установки вентиляции или водостоков и проект приходится пересматривать.
  </li>
</ul>
<h2>Преимущества профессионального замера от СтройКомплект</h2>
<ul>
  <li>Бесплатный выезд специалиста;</li>
  <li>Точные и полные измерения объекта, правильно занесенные в технический эскиз;</li>
  <li>Своевременное выявление дефектов объекта, которые нужно учитывать при расчетах;</li>
  <li>Информация о необходимости каких либо дополнительных работ и использования нестандартных аксессуаров;</li>
  <li>Помощь в подборе материала и его презентация;</li>
  <li>Индивидуальная консультация с ответами на ваши вопросы;</li>
</ul>
<div class="flex">
  <div>
   <img src="assets/images/content/zamer-2.png" alt="" width="400" />
  </div>
  <div class="flex flex-col flex-center">
  <p><a class="btn btn_style_base" href="akcii/besplatnyij-zamer/">Заказать замер кровли</a></p>
  <p><a class="btn btn_style_base" href="akcii/besplatnyij-zamer/">Заказать замер забора</a></p>
  </div>
</div>
