<?php

/**
 * Отдает массив с данными для выборки товаров с остатками на странице склада
 */

$data = null;
switch ($modx->context->key) {
    case 'web':
        $data = [
            [
                'title' => 'Наличие утеплителя <b>Rockwool</b>',
                'parents' => 93190
            ],
            [
                'title' => 'Наличие утеплителя <b>Технониколь</b>',
                'parents' => 93191
            ],
            [
                'title' => 'Наличие утеплителя <b>Penoplex</b>',
                'parents' => 93189
            ],
            [
                'title' => 'Наличие утеплителя <b>Knauf</b>',
                'parents' => 93185
            ],
            [
                'title' => 'Наличие утеплителя <b>Isover</b>',
                'parents' => 93187
            ]
        ];
        break;
    case 'suhiesmesi':
        $data = [
            ['title' => 'Наличие цемента', 'parents' => 123488],
            ['title' => 'Наличие ЦПС', 'parents' => 123489],
            ['title' => 'Наличие шпатлевки', 'parents' => 123498],
            ['title' => 'Наличие грунтовки', 'parents' => 123496],
            ['title' => 'Наличие кладочных смесей', 'parents' => 123494],
            ['title' => 'Наличие смесей для пола', 'parents' => 123497],
            ['title' => 'Наличие смесей для фасадов', 'parents' => 255739],
            ['title' => 'Наличие клея для газобетона', 'parents' => 123490],
            ['title' => 'Наличие клея для плитки', 'parents' => 123493],
            ['title' => 'Наличие клея для утеплителя', 'parents' => 123491],
            ['title' => 'Наличие клея для ПГП', 'parents' => 123492],
            ['title' => 'Наличие сыпучих материалов', 'parents' => 255659],
            ['title' => 'Наличие добавок и модификаторов сухих смесей', 'parents' => 123499],
            // ['title' => 'Наличие штукатурки', 'parents' => 123495]
        ];
        break;
}

return $data;
