<?php

$cacheFolder = 'getListingProductChars';
$cacheName = $src['id'];
$cacheOptions = [
    xPDO::OPT_CACHE_KEY => 'default/file_snippets/' . $cacheFolder . '/' . $src['context_key'] . '/',
];

// TODO: кешировать лучше не html, а массив. Меньше места будет заниматься.

//if (!$result = $modx->cacheManager->get($cacheName, $cacheOptions)) {
// Определяем, какие опции будут выводиться

$samovivoz = date('G') > 17 ? 'завтра' : 'сегодня';
$pdoTools = $modx->getService('pdoTools');

$arr = [
    'января',
    'февраля',
    'марта',
    'апреля',
    'мая',
    'июня',
    'июля',
    'августа',
    'сентября',
    'октября',
    'ноября',
    'декабря'
];

// Поскольку от 1 до 12, а в массиве, как мы знаем, отсчет идет от нуля (0 до 11),
// то вычитаем 1 чтоб правильно выбрать уже из нашего массива.


switch (true) {
    // Газосиликат
    case $modx->resource->context_key == 'gazosilikatstroy':
        $charsValues = [
            'Размер, мм' => ['val' => $src['razmer-mm']],
            'Кол-во на поддоне, шт' => ['val' => $src['pallet_num']],
        ];
        break;

    // ЖБИ
    case $modx->resource->context_key == 'gbi-zavod78':
        $charsValues = [
            'Категория' => ['val' => $src['kategoriya']],
            'Длина, мм' => ['val' => $src['dlina-mm']],
            'Ширина, мм' => ['val' => $src['shirina-mm']],
            'Высота, мм' => ['val' => $src['vysota-mm']],
            'Вес, т' => ['val' => $src['massa-t']],
        ];

        break;
    // Краска
    case $modx->resource->context_key == 'kraska':
        // Краски
        if (in_array($src['parent'], [125345, 167109, 167136, 167137, 167095, 165730, 167094, 103255, 165702, 165703, 165704, 165705, 165706, 165707, 165708, 165709, 165710, 165711, 165712, 165713, 165714, 165715, 165716, 165717, 165718, 165719, 165720, 165721, 165722, 165723, 165725, 165726, 165727, 165731, 165734, 165735, 165736, 165737, 165738, 165739, 165740, 165741, 165742, 165743, 165744, 165745, 165746, 165747, 165750, 165751, 165752, 165753, 165754, 165755, 165756, 165757, 165758, 165759, 165760, 165761, 165762, 165763, 165764, 165765, 165766, 165767, 165768, 165770, 165771, 165772, 165773, 165774, 165775, 165776, 165777, 165778, 165779, 165780, 165781, 165782, 165783, 165784, 165785, 165786, 165787, 165788, 165789, 165790, 165791, 165792, 165793, 165794, 165795, 165796, 165797, 165798, 165799, 165800, 165801, 165802, 165803, 165804, 165805, 165806, 165807, 165905, 165906, 165907, 165908, 165909, 165910, 165911, 165912, 165913, 165914, 165915, 165916, 165917, 165918, 165919, 165920, 165921, 165922, 165923, 165924, 165925, 165926, 165927, 165928, 165929, 165930, 165931, 165932, 165933, 165934, 165935, 165936, 165937, 165938, 165939, 165940, 165941, 165942, 165943, 165944, 165945, 165946, 165947, 165948, 165949, 165950, 165951, 165952, 165953, 165954, 165955, 165956, 165957, 165958, 165959, 165960, 165961, 165962, 165963, 165964, 165965, 165966, 165967, 165968, 165969, 165970, 165971, 165972, 165973, 165974, 165975, 165976, 165977, 165978, 165979, 165980, 165981, 167060, 167067, 167076, 165769])) {
            $charsValues = [];
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Цвет' => ['val' => $src['cvet']],
                'Цвет RAL' => ['val' => $src['cvet-ral']],
                'Оттенок' => ['val' => $src['ottenok']],
                'Применение' => ['val' => $src['primenenie']],
                'Объем' => ['val' => $src['obem-l']],
                'Без запаха' => ['val' => $src['bez-zapaha']],
                'Возможность колеровки' => ['val' => $src['vozmozhnost-kolerovki']],
            ]);
        } // Грунтовки
        elseif (in_array($src['parent'], [103082, 166458, 166457, 166456, 166454, 166455, 166453, 166452, 166450, 166451, 166449, 166448, 166447, 166446, 166445, 166444, 166443, 166442, 166440, 166441, 166439, 166438, 166437, 166435, 166436, 166434, 166433, 166431, 166432, 166430, 166429, 166427, 166428, 166426, 166425, 166423, 166424, 166422, 166421, 166420, 166418, 166419, 166417, 166416, 166415, 166414, 166413, 166412, 166411, 166410, 166409, 166407, 166408, 166406, 166405, 166404, 166403, 166402, 166400, 166401, 166399, 166398, 166397, 166396, 166395, 166394, 166392, 166393, 166391, 166390, 166388, 166389, 166387, 166386, 166384, 166385, 166383, 166382, 166381, 166379, 166380, 166378, 166376, 166377, 166375, 166374, 166373, 166371, 166372, 166370, 166369, 166367, 166368, 166366, 166365, 166364, 166362, 166363, 166361, 166360, 166358, 166359, 166357, 166356, 166355, 166353, 166354, 166352, 166351, 166349, 166350, 166348, 166347, 166346, 166344, 166345, 166343, 166342, 166340, 166341, 166339, 166338, 166336, 166337, 166335, 166334, 166332, 166333, 166331, 166329, 166330, 166328, 166327, 166325, 166326, 166324, 166323, 166321, 166322, 166320, 166319, 166318, 166316, 166317, 166315, 166314, 166313, 166312, 166311, 166309, 166310, 166308, 166306, 166307, 166305, 166304, 166303, 166301, 166302, 166300, 166298, 166299, 166297, 166296, 166294, 166295, 166293, 166292, 166291, 166289, 166290, 166288, 166286, 166287, 166285, 166283, 166284, 166282, 166281, 166280, 166278, 166279, 166277, 166276, 166275, 166274, 166273, 166272, 166271, 166270, 166268, 166269, 166267, 166266, 166265, 166264, 166262, 166263, 166261, 166260, 166258, 166259, 166257, 166256, 166254, 166255, 166253, 166251, 166252, 166250, 166249, 166247, 166248, 166246, 166245, 166244, 166243, 166242, 166241, 166240, 166238, 166239, 166237, 166235, 166236, 166234, 166232, 166233, 166231, 166229, 166230, 166228, 166227, 166225, 166226, 166224, 166223, 166221, 166222, 166220, 166219, 166217, 166218, 166216, 166215, 166214, 166212, 166213, 166211, 166210, 107934, 166208, 166209])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Применение' => ['val' => $src['primenenie']],
                'Объем' => ['val' => $src['obem-l']],
                'Время полного высыхания' => ['val' => $src['vremya-polnogo-vysyhaniya']],
                'Без запаха' => ['val' => $src['bez-zapaha']],
            ]);
        } 
        // Покрытия из дерева
        elseif (in_array($src['parent'], [103193,166845,166846,166844,166843,166841,166842,166840,166839,166837,166838,166836,166835,166833,166832,166830,166831,166829,166828,166827,166825,166826,166824,166822,166823,166821,166819,166820,166818,166816,166817,166815,166813,166814,166812,166811,166834,166928,166809,166810,166808,166807,166806,166804,166805,166803,166802,166800,166801,166799,166797,166798,166796,166795,166793,166794,166792,166791,166789,166790,166788,166787,166785,166786,166784,166782,166783,166781,166779,166780,166778,166776,166777,166774,166775,166773,166772,166770,166771,166769,166768,166766,166767,166765,166762,166763,166761,166760,166758,166756,166757,166755,166754,166753,166751,166752,166750,166748,166749,166747,166746,166745,166743,166744,166742,166741,166739,166740,166738,166736,166737,166735,166733,166734,166732,166730,166731,166729,166759,166764,166929,166728,166726,166727,166725,166723,166724,166721,166722,166720,166718,166719,166717,166716,166713,166711,166712,166710,166708,166709,166707,166706,166704,166705,166703,166701,166702,166700,166698,166699,166697,166695,166696,166694,166692,166693,166691,166690,166688,166686,166687,166684,166685,166683,166681,166682,166680,166678,166679,166677,166675,166676,166674,166672,166673,166671,166669,166670,166667,166668,166666,166664,166665,166663,166662,166659,166660,166658,166657,166655,166656,166653,166654,166652,166650,166651,166649,166647,166646,166644,166645,166642,166643,166641,166639,166640,166638,166648,166661,166689,166714,166715,166636,166637,166635,166633,166634,166631,166632,166630,166629,166627,166628,166626,166624,166622,166623,166621,166619,166620,166618,166616,166617,166615,166614,166612,166613,166611,166610,166608,166609,166607,166605,166606,166604,166602,166603,166601,166599,166600,166598,166596,166597,166595,166593,166594,166591,166592,166589,166588,166586,166584,166585,166582,166583,166581,166579,166580,166578,166577,166575,166576,166573,166574,166572,166571,166569,166570,166567,166568,166566,166564,166565,166587,166590,166625,103194,103471,106607,112002,112003,115691,166560,166561])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Применение' => ['val' => $src['primenenie']],
                'Объем' => ['val' => $src['obem-l']],
                'Цвет' => ['val' => $src['cvet']],
                'Цвет RAL' => ['val' => $src['cvet-ral']],
                'Без запаха' => ['val' => $src['bez-zapaha']],
            ]);
        } 
        // Эмали 
        elseif (in_array($src['parent'], [117397,167058,167059,167057,167055,167056,167054,167052,167053,167050,167051,167049,167047,167048,167045,167046,167043,167044,167042,167040,167041,167039,167037,167038,167036,167034,167035,167033,167031,167032,167029,167030,166559,166558,166556,166557,166555,166553,166554,166552,166550,166551,166548,166549,166547,166545,166546,166544,166542,166543,166541,166540,166538,166539,166536,166537,166534,166535,166533,166531,166532,166530,166528,166529,166527,166525,166526,166523,166524,166522,166520,166521,166519,166518,166516,166517,166514,166515,166513,166511,166512,166510,166508,166509,166507,166506,166505,166504,166502,166503,166501,166499,166500,166498,166497,166496,166495,166494,166493,166492,166491,166490,166489,166487,166488,166486,166484,166485,166483,166481,166482,166480,166479,166478,166476,166477,166475,166474,166473,166472,166470,166471,166469,166467,166468,166466,166464,166465,166463,166462,166461,166460,166459,166188,166195])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Применение' => ['val' => $src['primenenie']],
                'Разбавитель' => ['val' => $src['razbavitel']],
                'Время полного высыхания' => ['val' => $src['vremya-polnogo-vysyhaniya']],
            ]);
        } 
        // Лаки  
        elseif (in_array($src['parent'], [113157,165982,165983,165984,165985,165986,165987,165988,165989,165990,165991,165992,165993,165994,165995,165996,165997,165998,165999,166000,166001,166002,166003,166057,166058,166059,166060,166061,166062,166063,166064,166065,166066,166067,166068,166069,166070,166071,166072,166073,166074,166075,166076,166077,166078,166079,166080,166081,166082,166083,166084,166085,166086,166087,166088,166089,166090,166091,166092,166093,166094,166095,166096,166097,166098,166099,166100,166101,166102,166103,166104,166105,166106,166107,166108,166109,166110,166111,166112,166113,166114,166115,166116,166117,166118,166119,166120,166121,166122,166123,166124,166125,166126,166127,166128,166129,166130,166131,166132,166133,166134,166135,166136,166137,166138,166139,166140,166141,166142,166143,166144,166145,166146,166147,166148,166149,166150,166151,166152,166153,166154,166155,166156,166157,166158,166159,166160,166161,166162,166163,166164,166165,166166,166167,166168,166169,166170,166171,166172,166173,166174,166175,166176,166177,166178,166179,166180,166181,166182,166183,166184,166185,166186,166187,166189,166190,166191,166192,166193,166194,166196,166197,166198,166199,166200,166201,166202,166203,166204,166205,166206,166207])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Применение' => ['val' => $src['primenenie']],
                'Степень блеска' => ['val' => $src['stepen-bleska']],
                'Время высыхания' => ['val' => $src['vremya-vysyhaniya']],
            ]);
        } 
        // Растворители и очистители 
        elseif (in_array($src['parent'], [112001, 120195, 120210])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Применение' => ['val' => $src['primenenie']],
                'Метод нанесения' => ['val' => $src['metod-naneseniya']],
            ]);
        } 
        // Колеры 
        elseif (in_array($src['parent'], [119822])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Тип' => ['val' => $src['tip']],
                'Цвет' => ['val' => $src['cvet']],
                'Цвет RAL' => ['val' => $src['cvet-ral']],
            ]);
        } 
        // Шпатлевки  
        elseif (in_array($src['parent'], [107936, 166927, 166926, 166925, 166924, 166923, 166922, 166921, 166920, 166919, 166918, 166917, 166916, 166915, 166914, 166913, 166912, 166911, 166910, 166909, 166908, 166907, 166906, 166905, 166904, 166903, 166902, 166901, 166900, 166899, 166898, 166897, 166896, 166895, 166894, 166893, 166892, 166890, 166891, 166889, 166888, 166887, 166886, 166885, 166884, 166883, 166882, 166881, 166880, 166879, 166878, 166877, 166875, 166876, 166874, 166873, 166871, 166872, 166870, 166869, 166868, 166867, 166865, 166866, 166864, 166863, 166862, 166861, 166860, 166858, 166859, 166857, 166856, 166855, 166854, 166852, 166853, 166851, 166850, 166848, 166849, 166847, 166563, 166562, 117692])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Применение' => ['val' => $src['primenenie']],
                'Основа' => ['val' => $src['osnova']],
                'Тип работ' => ['val' => $src['tip-rabot']],
                'Цвет' => ['val' => $src['cvet']],
                'Цвет RAL' => ['val' => $src['cvet-ral']],
            ]);
        } // Инструменты   
        elseif (in_array($src['parent'], [120953])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Применение' => ['val' => $src['primenenie']],
            ]);
        } // Добавки в сухие строительные смеси 
        elseif (in_array($src['parent'], [107935])) {
            $charsValues = [];
            if (!empty($src['stockNum'])) {
                $charsValues = ['В наличии' => ['val' => [$src['stockNum'] . ' шт.']]];
            }

            $charsValues = array_merge($charsValues, [
                'Срок поставки' => ['val' => ['1-2 дня']],
                'Самовывоз' => ['val' => [$samovivoz]],
                'Применение' => ['val' => $src['primenenie']],
            ]);
        }
        break;

    case $modx->resource->context_key == 'krovelnyjstroymarket':

            if(in_array($src['parent'], $pdoTools->runSnippet("@FILE snippets/getCategoriesListIds.php", ['parent' => '125621,125619'])))
            {
                // количество волн; высота волны, мм; толщина, мм; ширина, мм; длина, мм; площадь, м2
                $charsValues = [
                    'Количество волн' => ['val' => $src['kolichestvo-voln']],
                    'Высота волны, мм' => ['val' => $src['vysota-volny']],
                    'Толщина, мм' => ['val' => $src['item_thickness']],
                    'Ширина, мм' => ['val' => $src['item_width']],
                    'Длина, мм' => ['val' => $src['dlina']],
                    'Площадь, м2' => ['val' => $src['ploshad_m2']],
                ];
            }
            elseif(in_array($src['parent'], $pdoTools->runSnippet("@FILE snippets/getCategoriesListIds.php", ['parent' => 125537])))
            {
                // Завтрашний день
                $dateNext = new DateTime();
                $dateNext->modify('+1 days');
                $dataNextText =  $dateNext->format('d') . ' ' .  $arr[ $dateNext->format('m')-1];

                $charsValues = [
                    'Профиль' => ['val' => $src['profil']],
                    'Толщина, мм' => ['val' => $src['item_thickness']],
                    'Цвет' => ['val' => $src['cvet']],
                    'Покрытие' => ['val' => $src['pokrytie']],
                    'Общая ширина' => ['val' => $src['obshaya-shirina']],
                    'Дата поставки' => ['val' => [$dataNextText] ],
                ];
            }

            elseif(in_array($src['parent'], $pdoTools->runSnippet("@FILE snippets/getCategoriesListIds.php", ['parent' => 125540])))
            {
                $charsValues = [
                    'Цвет' => ['val' => $src['cvet']],
                    'Толщина, мм' => ['val' => $src['item_thickness']],
                    'Ширина, мм' => ['val' => $src['item_width']],
                    'Длина, мм' => ['val' => $src['item_length']],
                ];
            }

            elseif(in_array($src['parent'], $pdoTools->runSnippet("@FILE snippets/getCategoriesListIds.php", ['parent' => 125530])))
            {
                $charsValues = [
                    'Толщина, мм' => ['val' => $src['item_thickness']],
                    'Производитель' => ['val' => $src['proizvoditel']],
                    'Покрытие' => ['val' => $src['pokrytie']],
                    'Цвет' => ['val' => $src['cvet']],
                    'Вид поверхности' => ['val' => $src['vid-poverhnosti']],
                ];
            }

            elseif(in_array($src['parent'], $pdoTools->runSnippet("@FILE snippets/getCategoriesListIds.php", ['parent' => 125532])))
            {
                $charsValues = [
                    'Коллекция' => ['val' => $src['collection']],
                    'Покрытие' => ['val' => $src['pokrytie']],
                    'Оттенок' => ['val' => $src['ottenok']],
                ];
            }

            elseif(in_array($src['parent'], $pdoTools->runSnippet("@FILE snippets/getCategoriesListIds.php", ['parent' => 125535])))
            {
                $charsValues = [
                    'Коллекция' => ['val' => $src['collection']],
                    'Покрытие' => ['val' => $src['pokrytie']],
                    'Цвет' => ['val' => $src['cvet']],
                    'Общая ширина' => ['val' => $src['obshaya-shirina']],
                    'Полезная ширина' => ['val' => $src['poleznaya-shirina']],
                ];
            }

            elseif(in_array($src['parent'], $pdoTools->runSnippet("@FILE snippets/getCategoriesListIds.php", ['parent' => 165732])))
            {
                $charsValues = [
                    'Цвет' => ['val' => $src['cvet']],
                    'Толщина' => ['val' => $src['item_thickness']],
                    'Бренд' => ['val' => $src['brand']],
                    'Вид' => ['val' => $src['vid']],
                ];
            }
            break;

    case $modx->resource->context_key == 'suhiesmesi':

        $charsValues = $pdoTools->runSnippet("@FILE snippets/product/charecters/getValueCharecterFromJson.php", [
        'parent' => $src['parent'],
        'contextKey' => "suhiesmesi",
        'snippetDataCustom' => "@FILE snippets/product/charecters/dataCustomSnippet.php",
        'src' => $src
    ]);
        break;

    // В остальных случаях
    default:

        $charsValues = [
            'Применение' => ['val' => $src['primenenie']],
            'Плотность, кг/м3' => ['val' => $src['plotnost']],
            'Теплопроводность' => ['val' => $src['teploprovodnost']],
            'Площадь, м2' => ['val' => $src['ploshad_m2']],
            'Объем, м3' => ['val' => $src['obyem_m3']],
            'Кол-во в упаковке, шт' => ['val' => $src['v_upakovke']],
            'Кол-во в упаковке, п.м.' => ['val' => $pm],
        ];

        if (in_array($modx->resource->context_key, ['web'])) {
            $charsValues['Применение']['composite'] = true;
        }
        break;
}

// Получаем и обрабатываем составные опции. Это те, у которых несколько значений
$compositeTmp = array_filter($charsValues, function ($elem) {
    if (!empty($elem['composite'])) {
        return true;
    }
    return false;
});
foreach ($compositeTmp as $key => $val) {
    $charsValues[$key]['val'] = $val['val'][0];

    $countVal = count($val['val']);
    if ($countVal > 1) {
        $charsValues[$key]['val'] .= '...';
        for ($i = 1; $i < $countVal; $i++) {
            $charsValues[$key]['extra'][] = $val['val'][$i];
        }
    }
}
unset($compositeTmp);
$charsValues = array_filter($charsValues, function ($elem) {
    return !empty($elem['val']);
});

// Вывод
$result = '';
foreach ($charsValues as $key => $value) {
    $inner = '';

    if (!empty($value['composite'])) {
        $inner = $value['val'];

        if (!empty($value['extra'])) {
            $inner .= '
            <div class="product-card__chars-val-info-wrap">
                <span class="product-card__chars-val-info-btn">
                    <svg class="svg icon-info" xmlns="http://www.w3.org/2000/svg"
                         xmlns:xlink="http://www.w3.org/1999/xlink"
                         version="1.1">
                        <use xlink:href="' . $modx->config['template_path'] . 'img/svg-sprite.svg#icon-info"></use>
                    </svg>
                </span>
                <div class="product-card__chars-val-info">
                  ' . implode(', ', $value['extra']) . '
                </div>
            </div>
            ';
        }
    } else {
        $inner .= implode(', ', $value['val']);
    }

    $result .= '<div class="product-card__chars-line">
                   <span class="product-card__chars-span">
                   ' . $key . '
                   </span>
                   <span class="product-card__chars-val">
                   ' . $inner . '
                   </span>
               </div>';
}

//$modx->cacheManager->set($cacheName, $result, 0, $cacheOptions);
//}

return $result;
