<article class="content-block">
  <table>
    <tbody>
    <tr>
      <td>
        <p><strong>Способ доставки</strong></p>
      </td>
      <td>
        <p><strong>MAX длина груза, м</strong></p>
      </td>
      <td>
        <p><strong>Стоимость доставки по СПб</strong></p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 1,5 тн до 14 м3</p>
      </td>
      <td>
        <p>4</p>
      </td>
      <td>
        <p>1 200</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 1,5 тн до 20 м3</p>
      </td>
      <td>
        <p>4</p>
      </td>
      <td>
        <p>1 400</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 3,5 тн до 30 м3</p>
      </td>
      <td>
        <p>6</p>
      </td>
      <td>
        <p>1 600</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 5 тн до 30 м3</p>
      </td>
      <td>
        <p>6</p>
      </td>
      <td>
        <p>1 800</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 10 тн до 50 м3</p>
      </td>
      <td>
        <p>8</p>
      </td>
      <td>
        <p>2 000</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 20 тн до 80 м3</p>
      </td>
      <td>
        <p>8</p>
      </td>
      <td>
        <p>2 300</p>
      </td>
    </tr>
    </tbody>
  </table>
  <p>В понедельник, среду и субботу действует льготная доставка - 1200 рублей в районе 30 км от КАД</p>
  <p>Срок доставки: от 2 часов при наличии материала на складе, либо в выбранный Вами интервал времени.</p>
  <p>Окончательную стоимость доставки по Санкт-Петербургу и Ленинградской области рассчитывается менеджером, учитывая
    местоположение Вашего объекта и требуемого объема. <br/>Оформление заказа и доставки осуществляется по телефону <a
            href="tel:+78122091968">+7 (812) 209-19-68</a>, форме обратной связи или по почте <a
            href="mailto:tsk@www-minvata.ru">tsk@www-minvata.ru</a>.</p>
</article>
