{* &nbsp; в ячейках таблицы нужны, чтобы выравнивание по центру (text-align: center) выглядело лучше *}

<article class="block-delivery">
  <table class="block-delivery__table">
    <tbody>
    <tr>
      <th>
        <p><strong>Способ доставки</strong></p>
      </th>
      <th>
        <p><strong>MAX длина груза, м</strong></p>
      </th>
      <th>
        <p><strong>Стоимость доставки по СПб</strong></p>
      </th>
    </tr>
    <tr>
      <td>
        <p>Машина до 1,5 тн до 14 м3</p>
      </td>
      <td>
        <p>4</p>
      </td>
      <td>
        <p>от 1 200 руб</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 1,5 тн до 20 м3</p>
      </td>
      <td>
        <p>4</p>
      </td>
      <td>
        <p>от 1 400 руб</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 3,5 тн до 30 м3</p>
      </td>
      <td>
        <p>6</p>
      </td>
      <td>
        <p>от 1 600 руб</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 5 тн до 30 м3&nbsp;&nbsp;&nbsp;&nbsp;</p>
      </td>
      <td>
        <p>6</p>
      </td>
      <td>
        <p>от 1 800 руб</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 10 тн до 50 м3&nbsp;&nbsp;</p>
      </td>
      <td>
        <p>8</p>
      </td>
      <td>
        <p>от 2 000 руб</p>
      </td>
    </tr>
    <tr>
      <td>
        <p>Машина до 20 тн до 80 м3&nbsp;&nbsp;</p>
      </td>
      <td>
        <p>8</p>
      </td>
      <td>
        <p>от 2 300 руб</p>
      </td>
    </tr>
    </tbody>
  </table>
  <div class="content-block">
    <p class="block-delivery__intro">Во вторник, четверг и субботу действует льготная доставка - от 1 400 рублей в районе 30 км от КАД</p>
    <p>Срок доставки: от 2 часов при наличии материала на складе, либо в выбранный Вами интервал времени.</p>
    <p>Окончательную стоимость доставки по Санкт-Петербургу и Ленинградской области рассчитывается менеджером, учитывая
      местоположение Вашего объекта и требуемого объема. <br/>Оформление заказа и доставки осуществляется по телефону <a
              href="tel:+7 (812) 209-19-68">+7 (812) 209-19-68</a>, форме обратной связи или по почте <a
              href="mailto:{$_modx->config.mail_1}">{$_modx->config.mail_1}</a>.</p>
  </div>
</article>
