<?php

return [
    // kirpich-m: Все товары
    ["parents" => "18986", "start" => 500, "end" => 1000, "unique" => md5("Склад метро Пионерская")],
    ["parents" => "18986", "start" => 500, "end" => 1000, "unique" => md5("Склад Парнас")],
    ["parents" => "18986", "start" => 100, "end" => 300, "unique" => md5("Склад Красносельский район")],
    ["parents" => "18986", "start" => 1000, "end" => 3000, "unique" => md5("Склад Шушары")],
    ["parents" => "18986", "start" => 0, "end" => 500, "unique" => md5("Склад Полюстрово")],
    ["parents" => "18986", "start" => 0, "end" => 500, "unique" => md5("Склад Мурино")],
    ["parents" => "18986", "start" => 0, "end" => 100, "unique" => md5("Склад Новосаратовка")],
    ["parents" => "18986", "start" => 0, "end" => 100, "unique" => md5("Склад метро Волковская")],
    ["parents" => "18986", "start" => 0, "end" => 100, "unique" => md5("Склад метро Ладожская")],
    ["parents" => "18986", "start" => 0, "end" => 100, "unique" => md5("Склад Колтуши")],
    ["parents" => "18986", "start" => 0, "end" => 100, "unique" => md5("Склад Предпортовая")],
    ["parents" => "18986", "start" => 0, "end" => 100, "unique" => md5("Склад Шафировский проспект")],
    ["parents" => "18986", "start" => 0, "end" => 100, "unique" => md5("Склад метро Парк Победы")],
    ["parents" => "18986", "start" => 0, "end" => 100, "unique" => md5("Склад Гатчина")],
    ["parents" => "18986", "start" => 100 , "end" => 300, "unique" => md5("Склад Ржевка")],

];